---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetInputPoint(System.Guid)
source: html/c7a4dc5e-bc26-0987-4995-2c5d2dbcee70.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetInputPoint Method

Returns point with specified id. Returns null if specified point does not exist

## Syntax (C#)
```csharp
public ConnectionInputPoint GetInputPoint(
	Guid id
)
```

## Parameters
- **id** (`System.Guid`)